<?php
/* 
Ѕлог. (все функци€ми)
1. много€зычность
2. админка с логином и паролем (http auth)
3. возможность редактировать €зыковых файлов 
(€зыковых констант) и добавлени€ нового €зыка
4. возможность создани€ статических страниц и их редактировани€ (текстовый файл - как база данных)
5. страница блога (должна быть модераци€ при введени€ некультурных слов), валидаци€ данных
6. авторизаци€ через куки(галочка запомнить мен€) и сессии
7. статистика посещени€ сайта (файл уникальных пользователей. файл запросов.)
записали ай пи, посчитали (можно через куки).
рекомендации - буферизаци€, правильное применени€ include, require. не забывать
про валидацию
функци€ eval -  например, есть ua.lang.php ,


 */
 
 
 
 
 
 
 
 
?>